# Assignment 2 (Week 2)

>**Note**: Late submissions are ***`penalized`***.

## Name: Abidat Akin-Adedotun

In [1]:
#import libraries 

import pandas as pd
import sqlite3
conn = sqlite3.connect("week_2.db")
cursor = conn.cursor()
print("Successful")

Successful

In [2]:
%load_ext sql

In [3]:
#View tables in database
sql_query = """
        SELECT name FROM sqlite_master;
"""

# Execute
result = cursor.execute(sql_query)

# Display result
result.fetchall()

[('customers',),
 ('sqlite_sequence',),
 ('orders',),
 ('employee',),
 ('department',),
 ('students',),
 ('sqlite_autoindex_students_1',),
 ('products',)]

In [4]:
%sql sqlite:///week_2.db

In [5]:
#View tables in database

%%sql

SELECT name FROM sqlite_master;

 * sqlite:///week_2.db
Done.

[('customers',),
 ('sqlite_sequence',),
 ('orders',),
 ('employee',),
 ('department',),
 ('students',),
 ('sqlite_autoindex_students_1',),
 ('products',)]

## Qs 1: 

a. Given the table, `customers` and `orders` shown below, use a **subquery** to find the **customers** that did ***NOT*** place any orders. Display only the customer name(s).

**`customers`**

![image.png](https://i.postimg.cc/sx2WK6v3/image.png)


**`orders`**

![image.png](https://i.postimg.cc/T2H5fcKW/image.png)

b. Given the `products` table shown below:

[![image.png](https://i.postimg.cc/W18dpLXC/image.png)](https://postimg.cc/DSWv5DVP)

write a query that returns the price of each product at every store. Your result should look like this:

[![image.png](https://i.postimg.cc/s235K4Nd/image.png)](https://postimg.cc/FYnfH3vD)

**Hint:** Use `CASE` statement.

### NOTE: You must use a single query.

In [84]:
#Create Temporary table

%%sql

CREATE TEMP TABLE NEW AS SELECT a.id, a.name, b.order_id
    FROM customers a
JOIN orders b
ON a.id = b.id

 * sqlite:///week_2.db
(sqlite3.OperationalError) table NEW already exists
[SQL: CREATE TEMP TABLE NEW AS SELECT a.id, a.name, b.order_id
    FROM customers a
JOIN orders b
ON a.id = b.id]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [85]:
#Merge tables

%%sql

SELECT * FROM NEW;

 * sqlite:///week_2.db
Done.

[(1, 'Mike', 5), (2, 'Afam', None), (3, 'Deborah', None), (4, 'Yusuf', 3)]

In [117]:
#a - jupyter is not showing "none"
%%sql

SELECT name
    from NEW
where order_id ='None'

 * sqlite:///week_2.db
Done.

[]

In [45]:
#b 

%%sql

    SELECT 
        id,
        SUM(CASE WHEN store = "store a" THEN price ELSE 0 END) AS "store a",
        SUM(CASE WHEN store = "store b" THEN price ELSE 0 END) AS "store b",
        SUM(CASE WHEN store = "store c" THEN price ELSE 0 END) AS "store c"
    FROM products  
    GROUP BY id;

 * sqlite:///week_2.db
Done.

[(0, 10, 11, 12), (1, 33, 35, 34)]

## Qs 2: 

Given the tables `employee` and `department` shown below:

![image.png](https://i.postimg.cc/bw0J574p/image.png)

a. Write a query that generates the table shown below:

![image](https://i.postimg.cc/hjc3rdTK/image.pnghttps://i.postimg.cc/hjc3rdTK/image.png)

b. Write a query that determines the **highest earner** in **each department**.

c. Write a query that shows all the employees in each department **except** the **lowest earner**. i.e generate the table below

![image.png](https://i.postimg.cc/MHcmw7Q0/image.png)

In [125]:
#Create temporary table 

%%sql

CREATE TEMP TABLE employees AS SELECT a.name, a.salary, a.dept_id, b.dept_name
    FROM employee a
FULL JOIN department b
ON a.dept_id= b.id;

 * sqlite:///week_2.db
Done.

[]

In [126]:
#a - view table
%%sql

select * from employees;

 * sqlite:///week_2.db
Done.

[('Steve', 32000, 1, 'Sales'),
 ('Bola', 31000, 1, 'Sales'),
 ('Felix', 33000, 2, 'IT'),
 ('Babalola', 30200, 1, 'Sales'),
 ('Okafor', 25000, 2, 'IT'),
 ('Adigun', 30000, 1, 'Sales'),
 ('Gafar', 41000, 2, 'IT'),
 ('Amanda', 53000, 2, 'IT')]

In [130]:
#b 
%%sql

select *, max(salary) from employees 
group by dept_name;

 * sqlite:///week_2.db
Done.

[('Amanda', 53000, 2, 'IT', 53000), ('Steve', 32000, 1, 'Sales', 32000)]

In [131]:
%%sql

select *, min(salary) from employees 
group by dept_name;

 * sqlite:///week_2.db
Done.

[('Okafor', 25000, 2, 'IT', 25000), ('Adigun', 30000, 1, 'Sales', 30000)]

In [138]:
%%sql

select min(salary) from employees 
group by dept_name;

 * sqlite:///week_2.db
Done.

[(25000,), (30000,)]

In [139]:
#c

%%sql

select * 
    from employees 
where salary > (select min(salary) from employees 
                group by dept_name);

 * sqlite:///week_2.db
Done.

[('Steve', 32000, 1, 'Sales'),
 ('Bola', 31000, 1, 'Sales'),
 ('Felix', 33000, 2, 'IT'),
 ('Babalola', 30200, 1, 'Sales'),
 ('Adigun', 30000, 1, 'Sales'),
 ('Gafar', 41000, 2, 'IT'),
 ('Amanda', 53000, 2, 'IT')]

### Qs 3: Given the students table:

a. Write a query that creates a new column `percentage_score`.  The `percentage_score` is the mean of all the subjects for each student. Round the `percentage_score` to 2 decimal points and sort in descending order.

b. Write a query that selects **ONLY** the students that scored more than the mean of the `percentage_score`.

In [104]:
#Create temp table
%%sql

CREATE TEMP TABLE students_new AS select *, round((maths+english+physics)/3, 2) as percentage_score
from students
order by percentage_score desc;

 * sqlite:///week_2.db
Done.

[]

In [105]:
#a - view answer

%%sql

select * from students_new;

 * sqlite:///week_2.db
Done.

[('ux-012-013', 'Emeka', 'M', 95, 84, 94, 91.0),
 ('ux-012-020', 'Ahmed', 'M', 87, 94, 85, 88.0),
 ('ux-012-016', 'Esther', 'F', 93, 77, 91, 87.0),
 ('ux-012-014', 'Agnes', 'F', 80, 69, 88, 79.0),
 ('ux-012-018', 'Ogechi', 'F', 80, 69, 78, 75.0),
 ('ux-012-023', 'Dave', 'M', 77, 69, 70, 72.0),
 ('ux-012-015', 'Alimat', 'F', 69, 69, 77, 71.0),
 ('ux-012-019', 'Steve', 'M', 61, 69, 72, 67.0),
 ('ux-012-024', 'Seyi', 'M', 54, 83, 63, 66.0),
 ('ux-012-021', 'Samantha', 'F', 52, 69, 48, 56.0),
 ('ux-012-022', 'Philip', 'M', 51, 39, 45, 45.0),
 ('ux-012-017', 'Fred', 'M', 28, 57, 39, 41.0)]

In [107]:
#get average of percentage_score
%%sql 

select avg(percentage_score)
from students_new;

 * sqlite:///week_2.db
Done.

[(69.83333333333333,)]

In [109]:
#b 
%%sql

select name
    from students_new
where percentage_score > (select avg(percentage_score)
                            from students_new);

 * sqlite:///week_2.db
Done.

[('Emeka',),
 ('Ahmed',),
 ('Esther',),
 ('Agnes',),
 ('Ogechi',),
 ('Dave',),
 ('Alimat',)]